---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDiagramSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
source: html/bae5dfd5-548c-212d-5a73-45f62ea839de.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetDiagramSettings Method

Set diagram settings object for the style.

## Syntax (C#)
```csharp
public void SetDiagramSettings(
	AnalysisDisplayDiagramSettings diagramSettings
)
```

## Parameters
- **diagramSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - diagram settings were not created with the object.